; ModuleID = 'examples/example1/autogen/out.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._tag = type { i32, i32, i32 }
%struct._request_get_a_datatype = type { i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._response_get_a_datatype = type { double, %struct._trailer_datatype }
%struct._codec_map = type { i32, void (i8*, i8*, i64*)*, void (i8*, i8*, i64*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "a", scope: !2, file: !3, line: 37, type: !6, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_a", scope: !3, file: !3, line: 30, type: !4, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!3 = !DIFile(filename: "example1.c", directory: "/home/bflin/gaps/build/apps/examples/example1/temp")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !8, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project.git 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, globals: !10, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "/home/bflin/gaps/build/apps/examples/example1/temp/example1.c", directory: "/home/bflin/gaps/build/apps/examples/example1/temp")
!9 = !{}
!10 = !{!0}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "res_counter", scope: !13, file: !14, line: 45, type: !28, isLocal: true, isDefinition: true)
!13 = distinct !DISubprogram(name: "_handle_request_get_a", scope: !14, file: !14, line: 29, type: !15, scopeLine: 29, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !9)
!14 = !DIFile(filename: "orange_rpc.c", directory: "/home/bflin/gaps/build/apps/examples/example1/temp")
!15 = !DISubroutineType(types: !16)
!16 = !{null}
!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project.git 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !19, globals: !23, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "/home/bflin/gaps/build/apps/examples/example1/temp/orange_rpc.c", directory: "/home/bflin/gaps/build/apps/examples/example1/temp")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !{!11, !24, !26, !29}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "last_processed_result", scope: !13, file: !14, line: 46, type: !6, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "last_processed_error", scope: !13, file: !14, line: 47, type: !28, isLocal: true, isDefinition: true)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "inited", scope: !13, file: !14, line: 48, type: !28, isLocal: true, isDefinition: true)
!31 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project.git 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!32 = !{i32 7, !"Dwarf Version", i32 4}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{i32 1, !"wchar_size", i32 4}
!35 = !DILocation(line: 41, column: 5, scope: !2)
!36 = !DILocation(line: 42, column: 10, scope: !2)
!37 = !DILocation(line: 42, column: 3, scope: !2)
!38 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 44, type: !39, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!39 = !DISubroutineType(types: !40)
!40 = !{!28, !28, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!42 = !DILocalVariable(name: "argc", arg: 1, scope: !38, file: !3, line: 44, type: !28)
!43 = !DILocation(line: 44, column: 14, scope: !38)
!44 = !DILocalVariable(name: "argv", arg: 2, scope: !38, file: !3, line: 44, type: !41)
!45 = !DILocation(line: 44, column: 26, scope: !38)
!46 = !DILocation(line: 45, column: 10, scope: !38)
!47 = !DILocation(line: 45, column: 3, scope: !38)
!48 = !DILocalVariable(name: "t_tag", scope: !13, file: !14, line: 33, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !50, line: 25, baseType: !51)
!50 = !DIFile(filename: "partitioned/multithreaded/orange/myxdcomms.h", directory: "/home/bflin/gaps/build/apps/examples/example1")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !50, line: 21, size: 96, elements: !52)
!52 = !{!53, !59, !60}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !51, file: !50, line: 22, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 26, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 42, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !51, file: !50, line: 23, baseType: !54, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !51, file: !50, line: 24, baseType: !54, size: 32, offset: 64)
!61 = !DILocation(line: 33, column: 14, scope: !13)
!62 = !DILocalVariable(name: "o_tag", scope: !13, file: !14, line: 34, type: !49)
!63 = !DILocation(line: 34, column: 14, scope: !13)
!64 = !DILocation(line: 36, column: 5, scope: !13)
!65 = !DILocation(line: 41, column: 5, scope: !13)
!66 = !DILocalVariable(name: "psocket", scope: !13, file: !14, line: 50, type: !22)
!67 = !DILocation(line: 50, column: 11, scope: !13)
!68 = !DILocalVariable(name: "ssocket", scope: !13, file: !14, line: 51, type: !22)
!69 = !DILocation(line: 51, column: 11, scope: !13)
!70 = !DILocalVariable(name: "request_get_a", scope: !13, file: !14, line: 59, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_a_datatype", file: !72, line: 75, baseType: !73)
!72 = !DIFile(filename: "partitioned/multithreaded/autogen/codec.h", directory: "/home/bflin/gaps/build/apps/examples/example1")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_a_datatype", file: !72, line: 72, size: 160, elements: !74)
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !73, file: !72, line: 73, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !77, line: 26, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 41, baseType: !28)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !73, file: !72, line: 74, baseType: !80, size: 128, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !72, line: 28, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !72, line: 22, size: 128, elements: !82)
!82 = !{!83, !84, !85, !86, !90}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !81, file: !72, line: 23, baseType: !54, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !81, file: !72, line: 24, baseType: !54, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !81, file: !72, line: 25, baseType: !54, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !81, file: !72, line: 26, baseType: !87, size: 16, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !55, line: 25, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !57, line: 40, baseType: !89)
!89 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !81, file: !72, line: 27, baseType: !87, size: 16, offset: 112)
!91 = !DILocation(line: 59, column: 28, scope: !13)
!92 = !DILocation(line: 59, column: 5, scope: !13)
!93 = !DILocalVariable(name: "response_get_a", scope: !13, file: !14, line: 66, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_a_datatype", file: !72, line: 89, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_a_datatype", file: !72, line: 86, size: 192, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !95, file: !72, line: 87, baseType: !6, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !95, file: !72, line: 88, baseType: !80, size: 128, offset: 64)
!99 = !DILocation(line: 66, column: 29, scope: !13)
!100 = !DILocation(line: 66, column: 5, scope: !13)
!101 = !DILocalVariable(name: "mycmap", scope: !13, file: !14, line: 71, type: !102)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 38400, elements: !117)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "codec_map", file: !50, line: 39, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_codec_map", file: !50, line: 35, size: 192, elements: !105)
!105 = !{!106, !107, !116}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !104, file: !50, line: 36, baseType: !28, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !104, file: !50, line: 37, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "codec_func_ptr", file: !50, line: 34, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !22, !22, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 46, baseType: !115)
!114 = !DIFile(filename: "/usr/local/lib/clang/10.0.1/include/stddef.h", directory: "")
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !104, file: !50, line: 38, baseType: !108, size: 64, offset: 128)
!117 = !{!118}
!118 = !DISubrange(count: 200)
!119 = !DILocation(line: 71, column: 16, scope: !13)
!120 = !DILocalVariable(name: "i", scope: !121, file: !14, line: 72, type: !28)
!121 = distinct !DILexicalBlock(scope: !13, file: !14, line: 72, column: 5)
!122 = !DILocation(line: 72, column: 14, scope: !121)
!123 = !DILocation(line: 72, column: 10, scope: !121)
!124 = !DILocation(line: 72, column: 19, scope: !125)
!125 = distinct !DILexicalBlock(scope: !121, file: !14, line: 72, column: 5)
!126 = !DILocation(line: 72, column: 21, scope: !125)
!127 = !DILocation(line: 72, column: 5, scope: !121)
!128 = !DILocation(line: 72, column: 53, scope: !125)
!129 = !DILocation(line: 72, column: 46, scope: !125)
!130 = !DILocation(line: 72, column: 56, scope: !125)
!131 = !DILocation(line: 72, column: 61, scope: !125)
!132 = !DILocation(line: 72, column: 41, scope: !125)
!133 = !DILocation(line: 72, column: 5, scope: !125)
!134 = distinct !{!134, !127, !135}
!135 = !DILocation(line: 72, column: 62, scope: !121)
!136 = !DILocation(line: 73, column: 99, scope: !13)
!137 = !DILocation(line: 73, column: 5, scope: !13)
!138 = !DILocation(line: 74, column: 102, scope: !13)
!139 = !DILocation(line: 74, column: 5, scope: !13)
!140 = !DILocalVariable(name: "ctx", scope: !13, file: !14, line: 77, type: !22)
!141 = !DILocation(line: 77, column: 12, scope: !13)
!142 = !DILocation(line: 77, column: 18, scope: !13)
!143 = !DILocation(line: 78, column: 33, scope: !13)
!144 = !DILocation(line: 78, column: 15, scope: !13)
!145 = !DILocation(line: 78, column: 13, scope: !13)
!146 = !DILocation(line: 79, column: 40, scope: !13)
!147 = !DILocation(line: 79, column: 15, scope: !13)
!148 = !DILocation(line: 79, column: 13, scope: !13)
!149 = !DILocation(line: 80, column: 5, scope: !13)
!150 = !DILocalVariable(name: "proc_error", scope: !13, file: !14, line: 90, type: !28)
!151 = !DILocation(line: 90, column: 9, scope: !13)
!152 = !DILocation(line: 91, column: 5, scope: !13)
!153 = !DILocation(line: 91, column: 12, scope: !13)
!154 = !DILocation(line: 91, column: 23, scope: !13)
!155 = !DILocation(line: 92, column: 30, scope: !156)
!156 = distinct !DILexicalBlock(scope: !13, file: !14, line: 91, column: 29)
!157 = !DILocation(line: 92, column: 39, scope: !156)
!158 = !DILocation(line: 92, column: 63, scope: !156)
!159 = !DILocation(line: 92, column: 9, scope: !156)
!160 = !DILocalVariable(name: "req_counter", scope: !156, file: !14, line: 93, type: !28)
!161 = !DILocation(line: 93, column: 13, scope: !156)
!162 = !DILocation(line: 93, column: 41, scope: !156)
!163 = !DILocation(line: 93, column: 49, scope: !156)
!164 = !DILocation(line: 94, column: 12, scope: !165)
!165 = distinct !DILexicalBlock(scope: !156, file: !14, line: 94, column: 12)
!166 = !DILocation(line: 94, column: 26, scope: !165)
!167 = !DILocation(line: 94, column: 24, scope: !165)
!168 = !DILocation(line: 94, column: 12, scope: !156)
!169 = !DILocation(line: 95, column: 24, scope: !170)
!170 = distinct !DILexicalBlock(scope: !165, file: !14, line: 94, column: 38)
!171 = !DILocation(line: 96, column: 27, scope: !170)
!172 = !DILocation(line: 96, column: 25, scope: !170)
!173 = !DILocation(line: 97, column: 37, scope: !170)
!174 = !DILocation(line: 97, column: 35, scope: !170)
!175 = !DILocation(line: 98, column: 34, scope: !170)
!176 = !DILocation(line: 98, column: 28, scope: !170)
!177 = !DILocation(line: 98, column: 32, scope: !170)
!178 = !DILocation(line: 99, column: 36, scope: !170)
!179 = !DILocation(line: 99, column: 34, scope: !170)
!180 = !DILocation(line: 100, column: 9, scope: !170)
!181 = !DILocation(line: 102, column: 38, scope: !156)
!182 = !DILocation(line: 102, column: 50, scope: !156)
!183 = !DILocation(line: 102, column: 57, scope: !156)
!184 = !DILocation(line: 102, column: 78, scope: !156)
!185 = !DILocation(line: 102, column: 55, scope: !156)
